src/DataProcessors/ОбработкаСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаСкидок</Name>
			<Comment>Обработка скидок</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделения</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьВсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействующиеСкидки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачВремя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонВремя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДниНедели</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПравилаРасчетаСкидкиПоКоличеству</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтКоличества</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтСуммыЧека</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВычисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Comment>Наименование</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагВытеснения</Name>
							<Comment>Флаг вытеснения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтСуммыНакопленияНаКарте</Name>
							<Comment>Сумма накопительная, применяется совместно с дисконтной картой</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучнаяСкидка</Name>
							<Comment>Истина, если скидка задается в ручную. Ложь, если скидка автоматическая</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство документа, от которого зависить скидка</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСкидкиВОборудовании</Name>
							<Comment>Идентификатор</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяСуммаНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеСкидокСтроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьWebСервисОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рарус</Name>
					<Comment>Rarus</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКМ5</Name>
					<Comment>Сарабеев</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыРарусОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыРарусОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>POS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ОбработкаСкидок/Ext/ManagerModule.bsl
// Модуль менеджера обработки "Автоматическое снятие резервов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//получение списка скидок для установки и отмены
Функция СкидкиДляОбработки(Дата, Подразделения)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СкидкиДляВыгрузки.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	СкидкиДляВыгрузки.Наименование КАК Наименование,
	|	СкидкиДляВыгрузки.РучнаяСкидка КАК РучнаяСкидка,
	|	СкидкиДляВыгрузки.Объект КАК Объект,
	|	СкидкиДляВыгрузки.НачВремя КАК НачВремя,
	|	СкидкиДляВыгрузки.КонВремя КАК КонВремя,
	|	СкидкиДляВыгрузки.НачалоДействия КАК НачалоДействия,
	|	СкидкиДляВыгрузки.КонецДействия КАК КонецДействия,
	|	СкидкиДляВыгрузки.ДниНедели КАК ДниНедели,
	|	СкидкиДляВыгрузки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	СкидкиДляВыгрузки.ОтСуммыНакопленияНаКарте КАК ОтСуммыНакопленияНаКарте,
	|	СкидкиДляВыгрузки.Свойство КАК Свойство,
	|	СкидкиДляВыгрузки.ОтСуммыЧека КАК ОтСуммыЧека,
	|	СкидкиДляВыгрузки.ОтКоличества КАК ОтКоличества,
	|	СкидкиДляВыгрузки.Правило КАК Правило,
	|	СкидкиДляВыгрузки.Скидка КАК Скидка,
	|	СкидкиДляВыгрузки.ЗначениеСкидки КАК ЗначениеСкидки,
	|	СкидкиДляВыгрузки.СпособВычисления КАК СпособВычисления,
	|	СкидкиДляВыгрузки.ФлагВытеснения КАК ФлагВытеснения,
	|	СкидкиДляВыгрузки.ИдентификаторСкидкиВОборудовании КАК ИдентификаторСкидкиВОборудовании,
	|	СкидкиДляВыгрузки.КонтрольнаяСуммаНабора КАК КонтрольнаяСуммаНабора,
	|	МАКСИМУМ(ЕСТЬNULL(СкидкиДляВыгрузки.Регистратор,ЗНАЧЕНИЕ(Документ.НазначениеСкидокСтроки.ПустаяСсылка))) КАК Регистратор,
	|	Истина КАК Используется,
	|	СУММА(СкидкиДляВыгрузки.Загрузка) КАК Действует
	|ИЗ
	|	(ВЫБРАТЬ
	|		Скидки.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|		Скидки.Скидка КАК Скидка,
	|		Скидки.Скидка.Наименование КАК Наименование,
	|		ВЫБОР
	|			КОГДА Скидки.Объект ССЫЛКА Справочник.Номенклатура
	|				ТОГДА Скидки.Объект
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		КОНЕЦ КАК Объект,
	|		Скидки.СпособВычисления КАК СпособВычисления,
	|		Скидки.ВидСвойства КАК ВидСвойства,
	|		Скидки.Свойство КАК Свойство,
	|		Скидки.ЗначениеСкидки КАК ЗначениеСкидки,
	|		Скидки.ОтСуммыЧека КАК ОтСуммыЧека,
	|		Скидки.ОтСуммыСтроки КАК ОтСуммыСтроки,
	|		Скидки.ОтКоличества КАК ОтКоличества,
	|		Скидки.Правило КАК Правило,
	|		Скидки.ФлагВытеснения КАК ФлагВытеснения,
	|		Скидки.ОтСуммыНакопленияНаКарте КАК ОтСуммыНакопленияНаКарте,
	|		Скидки.РучнаяСкидка КАК РучнаяСкидка,
	|		Скидки.НачВремя КАК НачВремя,
	|		Скидки.КонВремя КАК КонВремя,
	|		Скидки.НачалоДействия КАК НачалоДействия,
	|		Скидки.КонецДействия КАК КонецДействия,
	|		Скидки.ДниНедели КАК ДниНедели,
	|		Скидки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		Скидки.ИдентификаторСкидкиВОборудовании КАК ИдентификаторСкидкиВОборудовании,
	|		Скидки.КонтрольнаяСуммаНабора КАК КонтрольнаяСуммаНабора,
	|		Скидки.Регистратор КАК Регистратор,
	//|		Скидки.Действует КАК Действует,
	|		0 КАК СкидкаВыгружена,
	|		1 КАК Загрузка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СкидкиШапки.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|			СкидкиШапки.Скидка КАК Скидка,
	|			ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Объект,
	|			СкидкиШапки.СпособВычисления КАК СпособВычисления,
	|			СкидкиШапки.Скидка.ВидСвойства КАК ВидСвойства,
	|			СкидкиШапки.Свойство КАК Свойство,
	|			СкидкиШапки.ЗначениеСкидки КАК ЗначениеСкидки,
	|			СкидкиШапки.ОтСуммыЧека КАК ОтСуммыЧека,
	|			0 КАК ОтСуммыСтроки,
	|			0 КАК ОтКоличества,
	|			ЗНАЧЕНИЕ(Перечисление.ПравилаРасчетаСкидкиПоКоличеству.ПустаяСсылка) КАК Правило,
	|			СкидкиШапки.ФлагВытеснения КАК ФлагВытеснения,
	|			СкидкиШапки.ОтСуммыНакопленияНаКарте КАК ОтСуммыНакопленияНаКарте,
	|			СкидкиШапки.РучнаяСкидка КАК РучнаяСкидка,
	|			СкидкиШапки.НачВремя КАК НачВремя,
	|			СкидкиШапки.КонВремя КАК КонВремя,
	|			СкидкиШапки.Период КАК НачалоДействия,
	|			СкидкиШапки.СрокДействия КАК КонецДействия,
	|			СкидкиШапки.ДниНедели КАК ДниНедели,
	|			СкидкиШапки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|			СкидкиШапки.ИдентификаторСкидкиВОборудовании,
	|			"""" КАК КонтрольнаяСуммаНабора,
	|			СкидкиШапки.Регистратор КАК Регистратор
	|		ИЗ
	|			РегистрСведений.СкидкиШапки.СрезПоследних(
	|					&Дата,
	|					&Дата <= КОНЕЦПЕРИОДА(СрокДействия,ДЕНЬ)
	|						И ПодразделениеКомпании В (&ПодразделенияКомпании)
	|						И Действует) КАК СкидкиШапки
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			СкидкиСтроки.ПодразделениеКомпании,
	|			СкидкиСтроки.Скидка,
	|			СкидкиСтроки.Объект,
	|			СкидкиСтроки.СпособВычисления,
	|			СкидкиСтроки.Скидка.ВидСвойства,
	|			СкидкиСтроки.Свойство,
	|			СкидкиСтроки.ЗначениеСкидки,
	|			0,
	|			СкидкиСтроки.ОтСуммыСтроки,
	|			СкидкиСтроки.ОтКоличества,
	|			СкидкиСтроки.Правило,
	|			СкидкиСтроки.ФлагВытеснения,
	|			СкидкиСтроки.ОтСуммыНакопленияНаКарте,
	|			СкидкиСтроки.РучнаяСкидка,
	|			СкидкиСтроки.НачВремя,
	|			СкидкиСтроки.КонВремя,
	|			СкидкиСтроки.Период,
	|			СкидкиСтроки.СрокДействия,
	|			СкидкиСтроки.ДниНедели,
	|			СкидкиСтроки.ДисконтнаяКарта,
	|			СкидкиСтроки.ИдентификаторСкидкиВОборудовании,
	|			СкидкиСтроки.КонтрольнаяСуммаНабора,
	|			СкидкиСтроки.Регистратор КАК Регистратор
	|		ИЗ
	|			РегистрСведений.СкидкиСтроки.СрезПоследних(
	|					&Дата,
	|					&Дата <= КОНЕЦПЕРИОДА(СрокДействия,ДЕНЬ)
	|						И ПодразделениеКомпании В (&ПодразделенияКомпании)
	|						И Действует) КАК СкидкиСтроки) КАК Скидки
	|		ГДЕ		
	|			Скидки.Регистратор ССЫЛКА Документ.МаркетинговаяАкция И Скидки.Регистратор.ит_Маркетплейс = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		СкидкиВОборудовании.ПодразделениеКомпании,
	|		СкидкиВОборудовании.Скидка,
	|		СкидкиВОборудовании.Наименование,
	|		СкидкиВОборудовании.Номенклатура,
	|		СкидкиВОборудовании.СпособВычисления,
	|		СкидкиВОборудовании.Скидка.ВидСвойства,
	|		СкидкиВОборудовании.Свойство,
	|		СкидкиВОборудовании.ЗначениеСкидки,
	|		СкидкиВОборудовании.СуммаЧека,
	|		0,
	|		СкидкиВОборудовании.Количество,
	|		СкидкиВОборудовании.Правило,
	|		СкидкиВОборудовании.ФлагВытеснения,
	|		СкидкиВОборудовании.СуммаНакопления,
	|		СкидкиВОборудовании.РучнаяСкидка,
	|		СкидкиВОборудовании.НачВремя,
	|		СкидкиВОборудовании.КонВремя,
	|		СкидкиВОборудовании.НачалоДействия,
	|		СкидкиВОборудовании.КонецДействия,
	|		СкидкиВОборудовании.ДниНедели,
	|		СкидкиВОборудовании.ДисконтнаяКарта,
	|		СкидкиВОборудовании.ИдентификаторСкидкиВОборудовании,
	|		СкидкиВОборудовании.КонтрольнаяСуммаНабора,
	|		NULL,
	|		1,
	|		0
	//|		ВЫБОР
	//|			КОГДА СкидкиВОборудовании.Действует
	//|				ТОГДА 1
	//|			ИНАЧЕ 0
	//|		КОНЕЦ,
	|	ИЗ
	|		РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|	ГДЕ
	|		СкидкиВОборудовании.Действует) КАК СкидкиДляВыгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	СкидкиДляВыгрузки.ПодразделениеКомпании,
	|	СкидкиДляВыгрузки.Наименование,
	|	СкидкиДляВыгрузки.РучнаяСкидка,
	|	СкидкиДляВыгрузки.Объект,
	|	СкидкиДляВыгрузки.НачВремя,
	|	СкидкиДляВыгрузки.КонВремя,
	|	СкидкиДляВыгрузки.НачалоДействия,
	|	СкидкиДляВыгрузки.КонецДействия,
	|	СкидкиДляВыгрузки.ДниНедели,
	|	СкидкиДляВыгрузки.ДисконтнаяКарта,
	|	СкидкиДляВыгрузки.ОтСуммыНакопленияНаКарте,
	|	СкидкиДляВыгрузки.Свойство,
	|	СкидкиДляВыгрузки.ОтСуммыЧека,
	|	СкидкиДляВыгрузки.ОтКоличества,
	|	СкидкиДляВыгрузки.Правило,
	|	СкидкиДляВыгрузки.Скидка,
	|	СкидкиДляВыгрузки.ЗначениеСкидки,
	|	СкидкиДляВыгрузки.СпособВычисления,
	|	СкидкиДляВыгрузки.ФлагВытеснения,
	|	СкидкиДляВыгрузки.ИдентификаторСкидкиВОборудовании,
	|	СкидкиДляВыгрузки.КонтрольнаяСуммаНабора
	|
	|ИМЕЮЩИЕ
	|	СУММА(СкидкиДляВыгрузки.СкидкаВыгружена) <> СУММА(СкидкиДляВыгрузки.Загрузка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СУММА(СкидкиДляВыгрузки.Загрузка)");
	
	Запрос.УстановитьПараметр("Дата"       , Дата);
	
	Запрос.УстановитьПараметр("ПодразделенияКомпании" , Подразделения);
	
	Возврат Запрос.Выполнить();
КонецФункции //СкидкиДляОбработки()	

Процедура ЗаполнитьПодразделения(Объект) Экспорт
	Объект.Подразделения.Очистить();
	Объект.Подразделения.Добавить(Справочники.ПодразделенияКомпании.ПустаяСсылка());
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Оборудование.ОсновнойОтдел.ПодразделениеКомпании КАК ПодразделениеКомпании
	                      |ИЗ
	                      |	Справочник.ПодключаемоеОборудование КАК Оборудование
	                      |ГДЕ
	                      |	НЕ Оборудование.ПометкаУдаления
	                      |	И Оборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.Рарус)
						  |	И Оборудование.ТипРарусОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыРарусОборудования.POS)");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.Подразделения.Добавить(Выборка.ПодразделениеКомпании);
	КонецЦикла;
КонецПроцедуры

// заполнение таблица скидок 
Процедура ЗаполнениеТаблицы(Объект) Экспорт
	Объект.ДействующиеСкидки.Очистить();
	
	// заполним таблицу скидками
	Объект.ДействующиеСкидки.Загрузить(СкидкиДляОбработки(Объект.Дата, Объект.Подразделения).Выгрузить());
	
	// установим все флаги
	Для Каждого Строка Из Объект.ДействующиеСкидки Цикл
		Строка.Пометка	 = Истина;
		Строка.Видимость = Истина;
	КонецЦикла;
КонецПроцедуры //ЗаполнениеТаблицы()


// выполним обработку
// Режим=Истина - Авто
Процедура ВыполнитьОбработку(Режим, Объект) Экспорт
	Если Режим Тогда
		ЗаполнитьПодразделения(Объект);
		Объект.Дата = ТекущаяДата();
		ЗаполнениеТаблицы(Объект);
	КонецЕсли;
	
	СкидкиВОборудовании = РегистрыСведений.СкидкиВОборудовании.СоздатьНаборЗаписей();
	//СкидкиВОборудовании.ТаблицаСкидок = Объект.ДействующиеСкидки.Выгрузить();
	СкидкиВОборудовании.ЗаписатьСкидки(Объект.ДействующиеСкидки.Выгрузить());
	
	// инвалидируем товары
	//ИнвТоваров();
КонецПроцедуры //ВыполнитьОбработку()
	
#КонецЕсли
